using Tyuiu.SologubNV.Sprint3.Task0.V28.Lib;
using static System.Console;
class Program
{
    static void Main(string[] args)
    {
        DataService ds = new DataService();
        Title = "Спринт #3 | Выполнил: Сологуб Н.В | ИБКСб-26-1";
        WriteLine("***************************************************************************");
        WriteLine("* Спринт #3                                                               *");
        WriteLine("* Тема: Оператор цикла for                                                *");
        WriteLine("* Задание #0                                                              *");
        WriteLine("* Вариант #28                                                             *");
        WriteLine("* Выполнил: Сологуб Николай Витальевич | ИБКСб-26-1                       *");
        WriteLine("***************************************************************************");
        WriteLine("* УСЛОВИЕ;                                                                *");
        WriteLine("* Написать программу используя цикл for, которая вычисляет                *");
        WriteLine("* произведение ряда по формуле, при X=0,25                                *");
        WriteLine("*        17                                                               *");
        WriteLine("*   p =  П(x^3*i)+2                                                       *"); 
        WriteLine("*       i+1                                                               *");
        WriteLine("***************************************************************************");
        WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                         ");
        WriteLine("***************************************************************************");
        double x = 0.25; 
        int sv = 1;
        int ev = 17;
        WriteLine($"Переменная X = {x}");
        WriteLine($"Старт Шага = {sv}");
        WriteLine($"Конец Шага = {ev}");
        WriteLine("***************************************************************************");
        WriteLine("* РЕЗУЛЬТАТ                                                               *");
        WriteLine("***************************************************************************");
        WriteLine($"Произведение ряда = {ds.GetMultiplySeries(x,sv,ev)}");
        ReadLine();
    }
}