using Tyuiu.SologubNV.Sprint3.Task6.V16.Lib;
using static System.Console;
class Program
{
    static void Main(string[] args)
    {
        DataService ds = new DataService();
        Title = "Спринт #3 | Выполнил: Сологуб Н.В | ИБКСб-26-1";
        WriteLine("***************************************************************************");
        WriteLine("* Спринт #3                                                               *");
        WriteLine("* Тема: Оператор цикла do-while                                           *");
        WriteLine("* Задание #4                                                              *");
        WriteLine("* Вариант #29                                                             *");
        WriteLine("* Выполнил: Сологуб Николай Витальевич | ИБКСб-26-1                       *");
        WriteLine("***************************************************************************");
        WriteLine("* УСЛОВИЕ;                                                                *");
        WriteLine("* Напишите программу, которая ищет среди целых чисел, принадлежащих       *");
        WriteLine("* числовому отрезку [5, 16] количество всех делителей                     *");
        WriteLine("*                                                                         *");
        WriteLine("***************************************************************************");
        WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                         ");
        WriteLine("***************************************************************************");
        int sv = 5;
        int ev = 16;
        WriteLine($"Начало отрезка = {sv}");
        WriteLine($"Конец отрезка= {ev}");
        WriteLine("***************************************************************************");
        WriteLine("* РЕЗУЛЬТАТ                                                               *");
        WriteLine("***************************************************************************");
        WriteLine($"Количество делителей = {ds.GetSumTheDivisors(sv,ev)}");
        ReadLine();
    }
}