using Tyuiu.SologubNV.Sprint3.Task4.V29.Lib;
using static System.Console;
class Program
{
    static void Main(string[] args)
    {
        DataService ds = new DataService();
        Title = "Спринт #3 | Выполнил: Сологуб Н.В | ИБКСб-26-1";
        WriteLine("***************************************************************************");
        WriteLine("* Спринт #3                                                               *");
        WriteLine("* Тема: Оператор цикла do-while                                           *");
        WriteLine("* Задание #4                                                              *");
        WriteLine("* Вариант #29                                                             *");
        WriteLine("* Выполнил: Сологуб Николай Витальевич | ИБКСб-26-1                       *");
        WriteLine("***************************************************************************");
        WriteLine("* УСЛОВИЕ;                                                                *");
        WriteLine("* На отрезке, где x принимает значения от -5 до 5, вычислить значение     *");
        WriteLine("* функции y=cos(x)/x                                                      *");
        WriteLine("* При х = 0 пропустить значение. Полученные значения суммировать.         *");
        WriteLine("*                                                                         *");
        WriteLine("***************************************************************************");
        WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                         ");
        WriteLine("***************************************************************************");
        int sv = -5;
        int ev = 5;
        WriteLine($"Старт Шага = {sv}");
        WriteLine($"Конец Шага = {ev}");
        WriteLine("***************************************************************************");
        WriteLine("* РЕЗУЛЬТАТ                                                               *");
        WriteLine("***************************************************************************");
        WriteLine($"Сумма ряда = {ds.Calculate(sv, ev)}");
        ReadLine();
    }
}